MikroElektronika/core_packages/PIC/XC8/def/PIC18LF27K42/mcu.h
// Register: DMA2DPTRH
#define DMA2DPTRH DMA2DPTRH
extern volatile unsigned char           DMA2DPTRH           __at(0x3BCD);
#ifndef _LIB_BUILD
asm("DMA2DPTRH equ 03BCDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DPTR                   :8;
    };
    struct {
        unsigned DPTR8                  :1;
        unsigned DPTR9                  :1;
        unsigned DPTR10                 :1;
        unsigned DPTR11                 :1;
        unsigned DPTR12                 :1;
        unsigned DPTR13                 :1;
        unsigned DPTR14                 :1;
        unsigned DPTR15                 :1;
    };
    struct {
        unsigned DMA2DPTR               :8;
    };
    struct {
        unsigned DMA2DPTR8              :1;
        unsigned DMA2DPTR9              :1;
        unsigned DMA2DPTR10             :1;
        unsigned DMA2DPTR11             :1;
        unsigned DMA2DPTR12             :1;
        unsigned DMA2DPTR13             :1;
        unsigned DMA2DPTR14             :1;
        unsigned DMA2DPTR15             :1;
    };
} DMA2DPTRHbits_t;
extern volatile DMA2DPTRHbits_t DMA2DPTRHbits __at(0x3BCD);
// bitfield macros
#define _DMA2DPTRH_DPTR_POSN                                0x0
#define _DMA2DPTRH_DPTR_POSITION                            0x0
#define _DMA2DPTRH_DPTR_SIZE                                0x8
#define _DMA2DPTRH_DPTR_LENGTH                              0x8
#define _DMA2DPTRH_DPTR_MASK                                0xFF
#define _DMA2DPTRH_DPTR8_POSN                               0x0
#define _DMA2DPTRH_DPTR8_POSITION                           0x0
#define _DMA2DPTRH_DPTR8_SIZE                               0x1
#define _DMA2DPTRH_DPTR8_LENGTH                             0x1
#define _DMA2DPTRH_DPTR8_MASK                               0x1
#define _DMA2DPTRH_DPTR9_POSN                               0x1
#define _DMA2DPTRH_DPTR9_POSITION                           0x1
#define _DMA2DPTRH_DPTR9_SIZE                               0x1
#define _DMA2DPTRH_DPTR9_LENGTH                             0x1
#define _DMA2DPTRH_DPTR9_MASK                               0x2
#define _DMA2DPTRH_DPTR10_POSN                              0x2
#define _DMA2DPTRH_DPTR10_POSITION                          0x2
#define _DMA2DPTRH_DPTR10_SIZE                              0x1
#define _DMA2DPTRH_DPTR10_LENGTH                            0x1
#define _DMA2DPTRH_DPTR10_MASK                              0x4
#define _DMA2DPTRH_DPTR11_POSN                              0x3
#define _DMA2DPTRH_DPTR11_POSITION                          0x3
#define _DMA2DPTRH_DPTR11_SIZE                              0x1
#define _DMA2DPTRH_DPTR11_LENGTH                            0x1
#define _DMA2DPTRH_DPTR11_MASK                              0x8
#define _DMA2DPTRH_DPTR12_POSN                              0x4
#define _DMA2DPTRH_DPTR12_POSITION                          0x4
#define _DMA2DPTRH_DPTR12_SIZE                              0x1
#define _DMA2DPTRH_DPTR12_LENGTH                            0x1
#define _DMA2DPTRH_DPTR12_MASK                              0x10
#define _DMA2DPTRH_DPTR13_POSN                              0x5
#define _DMA2DPTRH_DPTR13_POSITION                          0x5
#define _DMA2DPTRH_DPTR13_SIZE                              0x1
#define _DMA2DPTRH_DPTR13_LENGTH                            0x1
#define _DMA2DPTRH_DPTR13_MASK                              0x20
#define _DMA2DPTRH_DPTR14_POSN                              0x6
#define _DMA2DPTRH_DPTR14_POSITION                          0x6
#define _DMA2DPTRH_DPTR14_SIZE                              0x1
#define _DMA2DPTRH_DPTR14_LENGTH                            0x1
#define _DMA2DPTRH_DPTR14_MASK                              0x40
#define _DMA2DPTRH_DPTR15_POSN                              0x7
#define _DMA2DPTRH_DPTR15_POSITION                          0x7
#define _DMA2DPTRH_DPTR15_SIZE                              0x1
#define _DMA2DPTRH_DPTR15_LENGTH                            0x1
#define _DMA2DPTRH_DPTR15_MASK                              0x80
#define _DMA2DPTRH_DMA2DPTR_POSN                            0x0
#define _DMA2DPTRH_DMA2DPTR_POSITION                        0x0
#define _DMA2DPTRH_DMA2DPTR_SIZE                            0x8
#define _DMA2DPTRH_DMA2DPTR_LENGTH                          0x8
#define _DMA2DPTRH_DMA2DPTR_MASK                            0xFF
#define _DMA2DPTRH_DMA2DPTR8_POSN                           0x0
#define _DMA2DPTRH_DMA2DPTR8_POSITION                       0x0
#define _DMA2DPTRH_DMA2DPTR8_SIZE                           0x1
#define _DMA2DPTRH_DMA2DPTR8_LENGTH                         0x1
#define _DMA2DPTRH_DMA2DPTR8_MASK                           0x1
#define _DMA2DPTRH_DMA2DPTR9_POSN                           0x1
#define _DMA2DPTRH_DMA2DPTR9_POSITION                       0x1
#define _DMA2DPTRH_DMA2DPTR9_SIZE                           0x1
#define _DMA2DPTRH_DMA2DPTR9_LENGTH                         0x1
#define _DMA2DPTRH_DMA2DPTR9_MASK                           0x2
#define _DMA2DPTRH_DMA2DPTR10_POSN                          0x2
#define _DMA2DPTRH_DMA2DPTR10_POSITION                      0x2
#define _DMA2DPTRH_DMA2DPTR10_SIZE                          0x1
#define _DMA2DPTRH_DMA2DPTR10_LENGTH                        0x1
#define _DMA2DPTRH_DMA2DPTR10_MASK                          0x4
#define _DMA2DPTRH_DMA2DPTR11_POSN                          0x3
#define _DMA2DPTRH_DMA2DPTR11_POSITION                      0x3
#define _DMA2DPTRH_DMA2DPTR11_SIZE                          0x1
#define _DMA2DPTRH_DMA2DPTR11_LENGTH                        0x1
#define _DMA2DPTRH_DMA2DPTR11_MASK                          0x8
#define _DMA2DPTRH_DMA2DPTR12_POSN                          0x4
#define _DMA2DPTRH_DMA2DPTR12_POSITION                      0x4
#define _DMA2DPTRH_DMA2DPTR12_SIZE                          0x1
#define _DMA2DPTRH_DMA2DPTR12_LENGTH                        0x1
#define _DMA2DPTRH_DMA2DPTR12_MASK                          0x10
#define _DMA2DPTRH_DMA2DPTR13_POSN                          0x5
#define _DMA2DPTRH_DMA2DPTR13_POSITION                      0x5
#define _DMA2DPTRH_DMA2DPTR13_SIZE                          0x1
#define _DMA2DPTRH_DMA2DPTR13_LENGTH                        0x1
#define _DMA2DPTRH_DMA2DPTR13_MASK                          0x20
#define _DMA2DPTRH_DMA2DPTR14_POSN                          0x6
#define _DMA2DPTRH_DMA2DPTR14_POSITION                      0x6
#define _DMA2DPTRH_DMA2DPTR14_SIZE                          0x1
#define _DMA2DPTRH_DMA2DPTR14_LENGTH                        0x1
#define _DMA2DPTRH_DMA2DPTR14_MASK                          0x40
#define _DMA2DPTRH_DMA2DPTR15_POSN                          0x7
#define _DMA2DPTRH_DMA2DPTR15_POSITION                      0x7
#define _DMA2DPTRH_DMA2DPTR15_SIZE                          0x1
#define _DMA2DPTRH_DMA2DPTR15_LENGTH                        0x1
#define _DMA2DPTRH_DMA2DPTR15_MASK                          0x80

