MikroElektronika/core_packages/PIC/XC8/def/PIC18LF27K42/mcu.h
extern volatile DMA1DCNTHbits_t DMA1DCNTHbits __at(0x3BEB);
// bitfield macros
#define _DMA1DCNTH_DCNT_POSN                                0x0
#define _DMA1DCNTH_DCNT_POSITION                            0x0
#define _DMA1DCNTH_DCNT_SIZE                                0x4
#define _DMA1DCNTH_DCNT_LENGTH                              0x4
#define _DMA1DCNTH_DCNT_MASK                                0xF
#define _DMA1DCNTH_DCNT8_POSN                               0x0
#define _DMA1DCNTH_DCNT8_POSITION                           0x0
#define _DMA1DCNTH_DCNT8_SIZE                               0x1
#define _DMA1DCNTH_DCNT8_LENGTH                             0x1
#define _DMA1DCNTH_DCNT8_MASK                               0x1
#define _DMA1DCNTH_DCNT9_POSN                               0x1
#define _DMA1DCNTH_DCNT9_POSITION                           0x1
#define _DMA1DCNTH_DCNT9_SIZE                               0x1
#define _DMA1DCNTH_DCNT9_LENGTH                             0x1
#define _DMA1DCNTH_DCNT9_MASK                               0x2
#define _DMA1DCNTH_DCNT10_POSN                              0x2
#define _DMA1DCNTH_DCNT10_POSITION                          0x2
#define _DMA1DCNTH_DCNT10_SIZE                              0x1
#define _DMA1DCNTH_DCNT10_LENGTH                            0x1
#define _DMA1DCNTH_DCNT10_MASK                              0x4
#define _DMA1DCNTH_DCNT11_POSN                              0x3
#define _DMA1DCNTH_DCNT11_POSITION                          0x3
#define _DMA1DCNTH_DCNT11_SIZE                              0x1
#define _DMA1DCNTH_DCNT11_LENGTH                            0x1
#define _DMA1DCNTH_DCNT11_MASK                              0x8
#define _DMA1DCNTH_DMA1SCNT_POSN                            0x0
#define _DMA1DCNTH_DMA1SCNT_POSITION                        0x0
#define _DMA1DCNTH_DMA1SCNT_SIZE                            0x4
#define _DMA1DCNTH_DMA1SCNT_LENGTH                          0x4
#define _DMA1DCNTH_DMA1SCNT_MASK                            0xF
#define _DMA1DCNTH_DMA1DCNT8_POSN                           0x0
#define _DMA1DCNTH_DMA1DCNT8_POSITION                       0x0
#define _DMA1DCNTH_DMA1DCNT8_SIZE                           0x1
#define _DMA1DCNTH_DMA1DCNT8_LENGTH                         0x1
#define _DMA1DCNTH_DMA1DCNT8_MASK                           0x1
#define _DMA1DCNTH_DMA1DCNT9_POSN                           0x1
#define _DMA1DCNTH_DMA1DCNT9_POSITION                       0x1
#define _DMA1DCNTH_DMA1DCNT9_SIZE                           0x1
#define _DMA1DCNTH_DMA1DCNT9_LENGTH                         0x1
#define _DMA1DCNTH_DMA1DCNT9_MASK                           0x2
#define _DMA1DCNTH_DMA1DCNT10_POSN                          0x2
#define _DMA1DCNTH_DMA1DCNT10_POSITION                      0x2
#define _DMA1DCNTH_DMA1DCNT10_SIZE                          0x1
#define _DMA1DCNTH_DMA1DCNT10_LENGTH                        0x1
#define _DMA1DCNTH_DMA1DCNT10_MASK                          0x4
#define _DMA1DCNTH_DMA1DCNT11_POSN                          0x3
#define _DMA1DCNTH_DMA1DCNT11_POSITION                      0x3
#define _DMA1DCNTH_DMA1DCNT11_SIZE                          0x1
#define _DMA1DCNTH_DMA1DCNT11_LENGTH                        0x1
#define _DMA1DCNTH_DMA1DCNT11_MASK                          0x8

// Register: DMA1DPTR
#define DMA1DPTR DMA1DPTR
extern volatile unsigned short          DMA1DPTR            __at(0x3BEC);
#ifndef _LIB_BUILD
asm("DMA1DPTR equ 03BECh");
#endif

// Register: DMA1DPTRL
#define DMA1DPTRL DMA1DPTRL
extern volatile unsigned char           DMA1DPTRL           __at(0x3BEC);
#ifndef _LIB_BUILD
asm("DMA1DPTRL equ 03BECh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DPTR                   :8;
    };
    struct {
        unsigned DPTR0                  :1;
        unsigned DPTR1                  :1;
        unsigned DPTR2                  :1;
        unsigned DPTR3                  :1;
        unsigned DPTR4                  :1;
        unsigned DPTR5                  :1;
        unsigned DPTR6                  :1;
        unsigned DPTR7                  :1;
    };
    struct {
        unsigned DMA1DPTR               :8;
    };
    struct {
        unsigned DMA1DPTR0              :1;
        unsigned DMA1DPTR1              :1;
        unsigned DMA1DPTR2              :1;
        unsigned DMA1DPTR3              :1;
        unsigned DMA1DPTR4              :1;
        unsigned DMA1DPTR5              :1;
        unsigned DMA1DPTR6              :1;
        unsigned DMA1DPTR7              :1;
    };
} DMA1DPTRLbits_t;
extern volatile DMA1DPTRLbits_t DMA1DPTRLbits __at(0x3BEC);
// bitfield macros
#define _DMA1DPTRL_DPTR_POSN                                0x0
#define _DMA1DPTRL_DPTR_POSITION                            0x0
#define _DMA1DPTRL_DPTR_SIZE                                0x8
#define _DMA1DPTRL_DPTR_LENGTH                              0x8
#define _DMA1DPTRL_DPTR_MASK                                0xFF
#define _DMA1DPTRL_DPTR0_POSN                               0x0
#define _DMA1DPTRL_DPTR0_POSITION                           0x0
#define _DMA1DPTRL_DPTR0_SIZE                               0x1
#define _DMA1DPTRL_DPTR0_LENGTH                             0x1
#define _DMA1DPTRL_DPTR0_MASK                               0x1
#define _DMA1DPTRL_DPTR1_POSN                               0x1
#define _DMA1DPTRL_DPTR1_POSITION                           0x1
#define _DMA1DPTRL_DPTR1_SIZE                               0x1
#define _DMA1DPTRL_DPTR1_LENGTH                             0x1
#define _DMA1DPTRL_DPTR1_MASK                               0x2
#define _DMA1DPTRL_DPTR2_POSN                               0x2
#define _DMA1DPTRL_DPTR2_POSITION                           0x2
#define _DMA1DPTRL_DPTR2_SIZE                               0x1
#define _DMA1DPTRL_DPTR2_LENGTH                             0x1
#define _DMA1DPTRL_DPTR2_MASK                               0x4
#define _DMA1DPTRL_DPTR3_POSN                               0x3
#define _DMA1DPTRL_DPTR3_POSITION                           0x3
#define _DMA1DPTRL_DPTR3_SIZE                               0x1
#define _DMA1DPTRL_DPTR3_LENGTH                             0x1
#define _DMA1DPTRL_DPTR3_MASK                               0x8
#define _DMA1DPTRL_DPTR4_POSN                               0x4
#define _DMA1DPTRL_DPTR4_POSITION                           0x4
#define _DMA1DPTRL_DPTR4_SIZE                               0x1
#define _DMA1DPTRL_DPTR4_LENGTH                             0x1
#define _DMA1DPTRL_DPTR4_MASK                               0x10
#define _DMA1DPTRL_DPTR5_POSN                               0x5
#define _DMA1DPTRL_DPTR5_POSITION                           0x5
#define _DMA1DPTRL_DPTR5_SIZE                               0x1
#define _DMA1DPTRL_DPTR5_LENGTH                             0x1
#define _DMA1DPTRL_DPTR5_MASK                               0x20
#define _DMA1DPTRL_DPTR6_POSN                               0x6
#define _DMA1DPTRL_DPTR6_POSITION                           0x6
#define _DMA1DPTRL_DPTR6_SIZE                               0x1
#define _DMA1DPTRL_DPTR6_LENGTH                             0x1
#define _DMA1DPTRL_DPTR6_MASK                               0x40
#define _DMA1DPTRL_DPTR7_POSN                               0x7
#define _DMA1DPTRL_DPTR7_POSITION                           0x7
#define _DMA1DPTRL_DPTR7_SIZE                               0x1
#define _DMA1DPTRL_DPTR7_LENGTH                             0x1
#define _DMA1DPTRL_DPTR7_MASK                               0x80
#define _DMA1DPTRL_DMA1DPTR_POSN                            0x0
#define _DMA1DPTRL_DMA1DPTR_POSITION                        0x0
#define _DMA1DPTRL_DMA1DPTR_SIZE                            0x8
#define _DMA1DPTRL_DMA1DPTR_LENGTH                          0x8
#define _DMA1DPTRL_DMA1DPTR_MASK                            0xFF
#define _DMA1DPTRL_DMA1DPTR0_POSN                           0x0
#define _DMA1DPTRL_DMA1DPTR0_POSITION                       0x0
#define _DMA1DPTRL_DMA1DPTR0_SIZE                           0x1
#define _DMA1DPTRL_DMA1DPTR0_LENGTH                         0x1
#define _DMA1DPTRL_DMA1DPTR0_MASK                           0x1
#define _DMA1DPTRL_DMA1DPTR1_POSN                           0x1
#define _DMA1DPTRL_DMA1DPTR1_POSITION                       0x1
#define _DMA1DPTRL_DMA1DPTR1_SIZE                           0x1
#define _DMA1DPTRL_DMA1DPTR1_LENGTH                         0x1
#define _DMA1DPTRL_DMA1DPTR1_MASK                           0x2
#define _DMA1DPTRL_DMA1DPTR2_POSN                           0x2
#define _DMA1DPTRL_DMA1DPTR2_POSITION                       0x2
#define _DMA1DPTRL_DMA1DPTR2_SIZE                           0x1
#define _DMA1DPTRL_DMA1DPTR2_LENGTH                         0x1
#define _DMA1DPTRL_DMA1DPTR2_MASK                           0x4
#define _DMA1DPTRL_DMA1DPTR3_POSN                           0x3
#define _DMA1DPTRL_DMA1DPTR3_POSITION                       0x3
#define _DMA1DPTRL_DMA1DPTR3_SIZE                           0x1
#define _DMA1DPTRL_DMA1DPTR3_LENGTH                         0x1
#define _DMA1DPTRL_DMA1DPTR3_MASK                           0x8
#define _DMA1DPTRL_DMA1DPTR4_POSN                           0x4
#define _DMA1DPTRL_DMA1DPTR4_POSITION                       0x4
#define _DMA1DPTRL_DMA1DPTR4_SIZE                           0x1
#define _DMA1DPTRL_DMA1DPTR4_LENGTH                         0x1
#define _DMA1DPTRL_DMA1DPTR4_MASK                           0x10
#define _DMA1DPTRL_DMA1DPTR5_POSN                           0x5
#define _DMA1DPTRL_DMA1DPTR5_POSITION                       0x5
#define _DMA1DPTRL_DMA1DPTR5_SIZE                           0x1
#define _DMA1DPTRL_DMA1DPTR5_LENGTH                         0x1
#define _DMA1DPTRL_DMA1DPTR5_MASK                           0x20
#define _DMA1DPTRL_DMA1DPTR6_POSN                           0x6
#define _DMA1DPTRL_DMA1DPTR6_POSITION                       0x6
#define _DMA1DPTRL_DMA1DPTR6_SIZE                           0x1
#define _DMA1DPTRL_DMA1DPTR6_LENGTH                         0x1
#define _DMA1DPTRL_DMA1DPTR6_MASK                           0x40
#define _DMA1DPTRL_DMA1DPTR7_POSN                           0x7
#define _DMA1DPTRL_DMA1DPTR7_POSITION                       0x7
#define _DMA1DPTRL_DMA1DPTR7_SIZE                           0x1
#define _DMA1DPTRL_DMA1DPTR7_LENGTH                         0x1
#define _DMA1DPTRL_DMA1DPTR7_MASK                           0x80

// Register: DMA1DPTRH
#define DMA1DPTRH DMA1DPTRH
extern volatile unsigned char           DMA1DPTRH           __at(0x3BED);
#ifndef _LIB_BUILD
asm("DMA1DPTRH equ 03BEDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DPTR                   :8;
    };
    struct {
        unsigned DPTR8                  :1;
        unsigned DPTR9                  :1;
        unsigned DPTR10                 :1;
        unsigned DPTR11                 :1;
        unsigned DPTR12                 :1;
        unsigned DPTR13                 :1;
        unsigned DPTR14                 :1;
        unsigned DPTR15                 :1;
    };
    struct {
        unsigned DMA1DPTR               :8;
    };
    struct {
        unsigned DMA1DPTR8              :1;
        unsigned DMA1DPTR9              :1;
        unsigned DMA1DPTR10             :1;
        unsigned DMA1DPTR11             :1;
        unsigned DMA1DPTR12             :1;
        unsigned DMA1DPTR13             :1;
        unsigned DMA1DPTR14             :1;
        unsigned DMA1DPTR15             :1;
    };
} DMA1DPTRHbits_t;
extern volatile DMA1DPTRHbits_t DMA1DPTRHbits __at(0x3BED);
// bitfield macros
#define _DMA1DPTRH_DPTR_POSN                                0x0
#define _DMA1DPTRH_DPTR_POSITION                            0x0
#define _DMA1DPTRH_DPTR_SIZE                                0x8
#define _DMA1DPTRH_DPTR_LENGTH                              0x8
#define _DMA1DPTRH_DPTR_MASK                                0xFF
#define _DMA1DPTRH_DPTR8_POSN                               0x0
#define _DMA1DPTRH_DPTR8_POSITION                           0x0
#define _DMA1DPTRH_DPTR8_SIZE                               0x1
#define _DMA1DPTRH_DPTR8_LENGTH                             0x1
#define _DMA1DPTRH_DPTR8_MASK                               0x1
#define _DMA1DPTRH_DPTR9_POSN                               0x1
#define _DMA1DPTRH_DPTR9_POSITION                           0x1
#define _DMA1DPTRH_DPTR9_SIZE                               0x1
#define _DMA1DPTRH_DPTR9_LENGTH                             0x1
#define _DMA1DPTRH_DPTR9_MASK                               0x2
#define _DMA1DPTRH_DPTR10_POSN                              0x2
#define _DMA1DPTRH_DPTR10_POSITION                          0x2
#define _DMA1DPTRH_DPTR10_SIZE                              0x1
#define _DMA1DPTRH_DPTR10_LENGTH                            0x1
#define _DMA1DPTRH_DPTR10_MASK                              0x4
#define _DMA1DPTRH_DPTR11_POSN                              0x3
#define _DMA1DPTRH_DPTR11_POSITION                          0x3
#define _DMA1DPTRH_DPTR11_SIZE                              0x1
#define _DMA1DPTRH_DPTR11_LENGTH                            0x1
#define _DMA1DPTRH_DPTR11_MASK                              0x8
#define _DMA1DPTRH_DPTR12_POSN                              0x4
#define _DMA1DPTRH_DPTR12_POSITION                          0x4
#define _DMA1DPTRH_DPTR12_SIZE                              0x1
#define _DMA1DPTRH_DPTR12_LENGTH                            0x1
#define _DMA1DPTRH_DPTR12_MASK                              0x10
#define _DMA1DPTRH_DPTR13_POSN                              0x5
#define _DMA1DPTRH_DPTR13_POSITION                          0x5
#define _DMA1DPTRH_DPTR13_SIZE                              0x1
#define _DMA1DPTRH_DPTR13_LENGTH                            0x1
#define _DMA1DPTRH_DPTR13_MASK                              0x20
#define _DMA1DPTRH_DPTR14_POSN                              0x6
#define _DMA1DPTRH_DPTR14_POSITION                          0x6
#define _DMA1DPTRH_DPTR14_SIZE                              0x1
#define _DMA1DPTRH_DPTR14_LENGTH                            0x1
#define _DMA1DPTRH_DPTR14_MASK                              0x40
#define _DMA1DPTRH_DPTR15_POSN                              0x7
#define _DMA1DPTRH_DPTR15_POSITION                          0x7
#define _DMA1DPTRH_DPTR15_SIZE                              0x1
#define _DMA1DPTRH_DPTR15_LENGTH                            0x1
#define _DMA1DPTRH_DPTR15_MASK                              0x80
#define _DMA1DPTRH_DMA1DPTR_POSN                            0x0
#define _DMA1DPTRH_DMA1DPTR_POSITION                        0x0
#define _DMA1DPTRH_DMA1DPTR_SIZE                            0x8
#define _DMA1DPTRH_DMA1DPTR_LENGTH                          0x8
#define _DMA1DPTRH_DMA1DPTR_MASK                            0xFF
#define _DMA1DPTRH_DMA1DPTR8_POSN                           0x0
#define _DMA1DPTRH_DMA1DPTR8_POSITION                       0x0
#define _DMA1DPTRH_DMA1DPTR8_SIZE                           0x1
#define _DMA1DPTRH_DMA1DPTR8_LENGTH                         0x1
#define _DMA1DPTRH_DMA1DPTR8_MASK                           0x1
#define _DMA1DPTRH_DMA1DPTR9_POSN                           0x1
#define _DMA1DPTRH_DMA1DPTR9_POSITION                       0x1
#define _DMA1DPTRH_DMA1DPTR9_SIZE                           0x1
#define _DMA1DPTRH_DMA1DPTR9_LENGTH                         0x1
#define _DMA1DPTRH_DMA1DPTR9_MASK                           0x2
#define _DMA1DPTRH_DMA1DPTR10_POSN                          0x2
#define _DMA1DPTRH_DMA1DPTR10_POSITION                      0x2
#define _DMA1DPTRH_DMA1DPTR10_SIZE                          0x1
#define _DMA1DPTRH_DMA1DPTR10_LENGTH                        0x1
#define _DMA1DPTRH_DMA1DPTR10_MASK                          0x4
#define _DMA1DPTRH_DMA1DPTR11_POSN                          0x3
#define _DMA1DPTRH_DMA1DPTR11_POSITION                      0x3
#define _DMA1DPTRH_DMA1DPTR11_SIZE                          0x1
#define _DMA1DPTRH_DMA1DPTR11_LENGTH                        0x1
#define _DMA1DPTRH_DMA1DPTR11_MASK                          0x8
#define _DMA1DPTRH_DMA1DPTR12_POSN                          0x4
#define _DMA1DPTRH_DMA1DPTR12_POSITION                      0x4
#define _DMA1DPTRH_DMA1DPTR12_SIZE                          0x1
#define _DMA1DPTRH_DMA1DPTR12_LENGTH                        0x1
#define _DMA1DPTRH_DMA1DPTR12_MASK                          0x10
#define _DMA1DPTRH_DMA1DPTR13_POSN                          0x5
#define _DMA1DPTRH_DMA1DPTR13_POSITION                      0x5
#define _DMA1DPTRH_DMA1DPTR13_SIZE                          0x1
#define _DMA1DPTRH_DMA1DPTR13_LENGTH                        0x1
#define _DMA1DPTRH_DMA1DPTR13_MASK                          0x20
#define _DMA1DPTRH_DMA1DPTR14_POSN                          0x6
#define _DMA1DPTRH_DMA1DPTR14_POSITION                      0x6
#define _DMA1DPTRH_DMA1DPTR14_SIZE                          0x1
#define _DMA1DPTRH_DMA1DPTR14_LENGTH                        0x1
#define _DMA1DPTRH_DMA1DPTR14_MASK                          0x40
#define _DMA1DPTRH_DMA1DPTR15_POSN                          0x7
#define _DMA1DPTRH_DMA1DPTR15_POSITION                      0x7
#define _DMA1DPTRH_DMA1DPTR15_SIZE                          0x1
#define _DMA1DPTRH_DMA1DPTR15_LENGTH                        0x1
#define _DMA1DPTRH_DMA1DPTR15_MASK                          0x80

// Register: DMA1DSZ
#define DMA1DSZ DMA1DSZ
extern volatile unsigned short          DMA1DSZ             __at(0x3BEE);
#ifndef _LIB_BUILD
asm("DMA1DSZ equ 03BEEh");
#endif

// Register: DMA1DSZL
#define DMA1DSZL DMA1DSZL
extern volatile unsigned char           DMA1DSZL            __at(0x3BEE);
#ifndef _LIB_BUILD
asm("DMA1DSZL equ 03BEEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSZ                    :8;
    };
    struct {
        unsigned DMA1DSZ                :8;
    };
    struct {
        unsigned DSZ0                   :1;
        unsigned DSZ1                   :1;
        unsigned DSZ2                   :1;
        unsigned DSZ3                   :1;
        unsigned DSZ4                   :1;
        unsigned DSZ5                   :1;
        unsigned DSZ6                   :1;
        unsigned DSZ7                   :1;
    };
    struct {
        unsigned DMA1DSZ0               :1;
        unsigned DMA1DSZ1               :1;
        unsigned DMA1DSZ2               :1;
        unsigned DMA1DSZ3               :1;
        unsigned DMA1DSZ4               :1;
        unsigned DMA1DSZ5               :1;
        unsigned DMA1DSZ6               :1;
        unsigned DMA1DSZ7               :1;
    };
} DMA1DSZLbits_t;
